Revit 2026 API

# DocumentDelete(ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> Delete(
	ICollection<ElementId> elementIds
)
```
```vb
Public Function Delete (
	elementIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ Delete(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member Delete :
        elementIds : ICollection<ElementId> -> ICollection<ElementId>
```

#### Parameters

elementIds ICollectionElementId

#### Return Value

ICollectionElementId

#### Reference

Document Class

Delete Overload

Autodesk.Revit.DB Namespace